[
    {
        "front": "What is economics?",
        "back": "Economics is the study of how individuals, businesses, and governments allocate resources to achieve the best possible outcomes in terms of production, consumption, and distribution.",
        "deck": "UNI::Sem5::Economics::Basics"
    },
    {
        "front": "What is opportunity cost?",
        "back": "Opportunity cost refers to the value of the next best alternative that must be foregone when making a choice. It's crucial for evaluating decisions as it highlights what you give up in order to achieve something desired.",
        "deck": "UNI::Sem5::Economics::Basics"
    },
    {
        "front": "Types of Economic Systems",
        "back": "Economic systems determine how resources are allocated and used in an economy. \nCapitalism: Private ownership through private markets, prices, and competition. \nSocialism: Political control over resource allocation by the government. \nMixed: Combination of capitalist and socialist elements. This system allows for greater economic flexibility but may also lead to inefficiencies.",
        "deck": "UNI::Sem5::Economics::Basics"
    },
    {
        "front": "What is GDP?",
        "back": "GDP (Gross Domestic Product) measures the total value of goods and services produced in a country during a specific period. It includes consumption, investment, government spending, and net exports. GDP growth can be calculated using formulas or indicators like index numbers.",
        "deck": "UNI::Sem5::Economics::Basics"
    },
    {
        "front": "What is inflation?",
        "back": "Inflation is a general increase in prices of goods and services over time, affecting most products and services worldwide.",
        "deck": "UNI::Sem5::Economics::Basics"
    },
    {
        "front": "What is the primary goal of government regulation in markets?",
        "back": "The primary goal of government regulation in markets is to protect consumers by ensuring fair pricing, quality, and access. Regulators also aim to prevent monopolies from dominating the market, promoting fair competition so businesses can thrive without undue restrictions.",
        "deck": "UNI::Sem5::Economics::Basics"
    },
    {
        "front": "What is fiscal policy?",
        "back": "Fiscal policy involves governments managing their money to finance public services (reduce income) or stimulate demand through increased spending.",
        "deck": "UNI::Sem5::Economics::Basics"
    }
]